development/existay/project/app/Controllers/AboutController.php

SELECT *
FROM `testimonial`
ORDER BY `id` DESC
---
    public function home()
    {

        $testimonial = new TestimonialModel();
        $testimonial = $testimonial->orderBy('id','desc')->findAll();