development/existay/project/app/Controllers/BaseController.php

    protected function getState(){
        $state = new StateModel();
        return $state->where("privacy", "public")->orderBy("state", "asc")->findAll();
---
SELECT *
FROM `states`
WHERE `privacy` = 'public'
ORDER BY `state` ASC