development/existay/project/app/Controllers/HomeController.php

SELECT *
FROM `states`
ORDER BY `state` ASC
SELECT *
FROM `testimonial`
ORDER BY `id` DESC
SELECT *
FROM `home`
 LIMIT 1
---
    public function home()
    {
        $state = new StateModel();
        $state = $state->orderBy("state", "asc")->findAll();

        $db = db_connect()
        $testimonial = new TestimonialModel();
        $testimonial = $testimonial->orderBy('id','desc')->findAll();

        $home = new HomeModel();
        $data = [
            "state"=>$this->getState(),
            "testimonial"=>$testimonial,
            "home"=>$home->first()